game-scenario-1000.yml
config:
  target: "{{ $env.TARGET }}"
  phases:
    - duration: 20 # 테스트 시간
      arrivalRate: 10 # 1초에 몇 명의 유저가 들어올 것인지 설정 (arrivalRate * duration = 총 유저 수, worker 5개 × 200 = 1000)
  processor: "processors.js"

# 5분 시나리오
scenarios:
  - name: "1-minute 1000 players test"
    beforeScenario: "connectSocket"
    afterScenario: "disconnectSocket"
    flow:
      - function: 'setPlayerName'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'chatMessage'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'updatePosition'
      - function: 'chatMessage'